app/controllers/secret_menu_items_controller.rb

SELECT "secret_menu_items".* FROM "secret_menu_items"
---
  def index
          @secretMenuItems = SecretMenuItem.all